<?php
/*
 * m-ini.php
 *
 * update:
 */
require_once(dirname(__FILE__) . '/server.conf.php');

$config = array_merge($config,
	array(
		//キャリア文字列
		'carrier' => array(
			1 => 'dc',
			2 => 'au',
			3 => 'sb',
			4 => ''
		),
		// Smarty
		'renderer' => array(
			'smarty' => array(
				'left_delimiter' => '{{',
				'right_delimiter' => '}}',
			),
		),
//EV
		//イベントID
		'evid' => 110224,
		//イベント終了日時
		'evEndTime' => '2011-03-07 23:59:59',
		//イベントdope効果
		'evDope0' => array(
			'o' => 1.5,
			'f' => 0,
		),
		'evDope1' => array(
			'o' => 2,
			'f' => 0,
		),
		//全制覇時アイテムID
		'compEvId' => 160,
		//イベントクエストカラー
		'evColor' => array(
			'main' => 'FF86B5',
			'sub' => 'F7457B',
			'text' => '000000',
		),
//EV
		//カードファイルMAX
		'cardFileMax' => 36,
		//ログ振分
		'lg_divide' => 2,
		//初期コメント
		'iniComment' => 'ひとことコメント',
//TUT
		//初期小判
		'iniMoney' => 200,
		//回復薬itemid
		'rcvItemid' => 114,
		//ガチャitemid
		'gachaItemid' => 115,
		//ガチャFREEitemid
		'gachaFreeItemid' => 139,
		//ガチャGOLDitemid
		'gachaGoldItemid' => 140,
		//ガチャぷらちなitemid
		'gachaPtItemid' => 141,
		//きびだんごitemid
		'kibiItemid' => 116,
		//千手観音
		'senjuId' => 160,
		//金のぶた
		'pigGoldId' => 161,
		//銀のぶた
		'pigSilvId' => 162,
		//チュートリ付与お宝
		'tutTr' => array(
			'id' => 1,
			'seriesid' => 1,
		),
		//最大周回／ステージ
		'maxCyc' => 3,
		//周回タイトル
		'cyTitle' => array(
			1 => 'Trận mở màn',
			2 => 'Trận trung tâm',
			3 => 'Trận quyết định',
			4 => 'Toàn thắng',
		),
		//最大護符設定数
		'maxTrap' => array(
			1 => 50,
			2 => 3,
		),
		//同盟効果pt(魔将ファイト)
		'legionPtCoeff0' => 0.05,
		'legionPtCoeff1' => 0.1,
		'legionPtCoeff2' => 0.15,
		//同盟効果LV(魔将ファイト)
		'legionLvCoeff0' => 0.02,
		'legionLvCoeff1' => 0.03,
		'legionLvCoeff2' => 0.04,
		//ファイト必要げんき
		'fightReqGenki' => 3,
		//ファイトLV許容ギャップ
		'fightLvGap' => 1.5,
		//魔将ダメージ係数
		'damageCoeff' => 0.2,
		//カード買取価格
		'cardCashBack' => array(
			1 => '10',//C
			2 => '20',//B
			3 => '30',//A
			4 => '40',//HG
			5 => '50',//VR
		),
		//TOP表示VR＋HG統計表示期間
		'rareTerm'=> 1,
		//TOP表示VR＋HGステージ乱数基
		'ranBase'=> 777,
		//初期登録カード(攻撃型)
		'reg_o' => array(
			'1' => 'e51e900bac38761a',
			'2' => 'f7a86d4b1b0bef26',
			'3' => 'fb2ea7f414ef210d',
			'4' => '311c3873845e8503',
			'5' => 'f702bdbb34c98ab9'
		),
		//初期登録カード(防御型)
		'reg_d' => array(
			1 => '96310f839fa23dc0',//伊達政宗(A)
			2 => '050469c0834a0015',//直江兼続(B)
			3 => '650ab9b2f4fa13e4',//濃姫(C)
			4 => '251b666906b2e138',//猿飛佐助(C)
			5 => '48d5018d5b5b0b47',//お市の方(C)
		),
		//初期登録カード(バランス型)
		'reg_b' => array(
			1 => '9b1cb1f0a53c3cc3',//上杉謙信(A)
			2 => 'cd3daeb068c9e6ca',//上泉信綱(B)
			3 => '7d9a260b432e0aad',//立花道雪(C)
			4 => '311c3873845e8503',//真田幸村(C)
			5 => 'd3cf187243beeccb',//竹中半兵衛(C)
		),
		//チュートファイト相手(攻撃型)
		'ot_o' => array(
			1 => array(
				'bushoid' => 'a8ba3a5a32b6a5db',
				'damage' => '0',
			),
			2 => array(
				'bushoid' => '3e9c3165310fb200',
				'damage' => '180',
			),
			3 => array(
				'bushoid' => '3e9c3165310fb200',
				'damage' => '225',
			),
			4 => array(
				'bushoid' => '9e225a197384d3f9',
				'damage' => '0',
			),
			5 => array(
				'bushoid' => '298159c7c9245854',
				'damage' => '197',
			),
		),
		//チュートファイト相手(防御型)
		'ot_d' => array(
			1 => array(
				'bushoid' => '298159c7c9245854',
				'damage' => '198',
			),
			2 => array(
				'bushoid' => '3e9c3165310fb200',
				'damage' => '178',
			),
			3 => array(
				'bushoid' => '9e225a197384d3f9',
				'damage' => '0',
			),
			4 => array(
				'bushoid' => '3e9c3165310fb200',
				'damage' => '0',
			),
			5 => array(
				'bushoid' => 'a8ba3a5a32b6a5db',
				'damage' => '169',
			),
		),
		//チュートファイト相手(ﾊﾞﾗﾝｽ型)
		'ot_b' => array(
				1 => array(
						'bushoid' => '3e9c3165310fb200',
						'damage' => '0',
					),
				2 => array(
						'bushoid' => '9e225a197384d3f9',
						'damage' => '214',
					),
				3 => array(
						'bushoid' => 'a8ba3a5a32b6a5db',
						'damage' => '227',
					),
				4 => array(
						'bushoid' => '298159c7c9245854',
						'damage' => '0',
					),
				5 => array(
						'bushoid' => '3e9c3165310fb200',
						'damage' => '170',
					),
		),
		//陣形マスタ(魔将一覧)8ID
		'mMASHO_SEQ' => array(
			'1' => '23',
			'2' => '24',
			'3' => '25',
			'4' => '26',
			'5' => '27',
			'6' => '28',
			'7' => '29',
			'8' => '30',
		),
		//陣形マスタ (1)
		'mFORM_1' => array(
			'1' => '5',//本多忠勝
			'2' => '12',//上泉信綱
			'3' => '16',//柳生石舟斎
			'4' => '19',//立花道雪
			'5' => '23',//李舜臣
		),
		//陣形マスタ (2)
		'mFORM_2' => array(
			'1' => '3',//真田幸村
			'2' => '9',//猿飛佐助
			'3' => '13',//伊達政宗
			'4' => '17',//森蘭丸
			'5' => '18',//竹中半兵衛
		),
		//陣形マスタ (3)
		'mFORM_3' => array(
			'1' => '1',//天草四郎
			'2' => '11',//前田慶次
			'3' => '20',//出雲阿国
			'4' => '21',//お市の方
			'5' => '26',//柴田勝家
		),
		//陣形マスタ (4)
		'mFORM_4' => array(
			'1' => '2',//武田信玄
			'2' => '4',//徳川家康
			'3' => '7',//織田信長
			'4' => '10',//羽柴秀吉
			'5' => '25',//毛利元就
		),
		//陣形マスタ (5)
		'mFORM_5' => array(
			'1' => '7',//織田信長
			'2' => '10',//羽柴秀吉
			'3' => '15',//明智光秀
			'4' => '17',//森蘭丸
			'5' => '22',//濃姫
		),
		//陣形マスタ (6)
		'mFORM_6' => array(
			'1' => '3',//真田幸村
			'2' => '8',//島津義弘
			'3' => '19',//立花道雪
			'4' => '25',//毛利元就
			'5' => '28',//石田三成
		),
		//陣形マスタ (7)
		'mFORM_7' => array(
			'1' => '4',//徳川家康
			'2' => '5',//本多忠勝
			'3' => '16',//柳生石舟斎
			'4' => '29',//服部半蔵
			'5' => '30',//南光坊天海
		),
		//陣形マスタ (8)
		'mFORM_8' => array(
			'1' => '3',//真田幸村
			'2' => '6',//直江兼続
			'3' => '10',//羽柴秀吉
			'4' => '18',//竹中半兵衛
			'5' => '28',//石田三成
		),
		//陣形マスタ (9)
		'mFORM_9' => array(
			'1' => '3',//真田幸村
			'2' => '6',//直江兼続
			'3' => '15',//明智光秀
			'4' => '18',//竹中半兵衛
			'5' => '28',//石田三成
		),
		//陣形マスタ (10)
		'mFORM_10' => array(
			'1' => '15',//明智光秀
			'2' => '20',//出雲阿国
			'3' => '21',//お市の方
			'4' => '22',//濃姫
			'5' => '28',//石田三成
		),
		//陣形マスタ (11)
		'mFORM_11' => array(
			'1' => '24',//最上義光
			'2' => '21',//お市の方
			'3' => '25',//毛利元就
			'4' => '27',//北条氏康
			'5' => '28',//石田三成
		),
		//お宝シリーズ1
		'mTR1' => array(
			'0' => '5',
			'1' => '4',
			'2' => '3',
			'3' => '2',
			'4' => '1',
		),
		//お宝シリーズ2
		'mTR2' => array(
			'0' => '10',
			'1' => '9',
			'2' => '8',
			'3' => '7',
			'4' => '6',
		),
		//お宝シリーズ3
		'mTR3' => array(
			'0' => '15',
			'1' => '14',
			'2' => '13',
			'3' => '12',
			'4' => '11',
		),
		//お宝シリーズ4
		'mTR4' => array(
			'0' => '20',
			'1' => '19',
			'2' => '18',
			'3' => '17',
			'4' => '16',
		),
		//お宝シリーズ5
		'mTR5' => array(
			'0' => '25',
			'1' => '24',
			'2' => '23',
			'3' => '22',
			'4' => '21',
		),
		//お宝シリーズ6
		'mTR6' => array(
			'0' => '30',
			'1' => '29',
			'2' => '28',
			'3' => '27',
			'4' => '26',
		),
		//お宝シリーズ7
		'mTR7' => array(
			'0' => '35',
			'1' => '34',
			'2' => '33',
			'3' => '32',
			'4' => '31',
		),
		//お宝シリーズ8
		'mTR8' => array(
			'0' => '40',
			'1' => '39',
			'2' => '38',
			'3' => '37',
			'4' => '36',
		),
	)
);
